content/posts/hooking_windows_apis_with_python.md
+++
title = "Hooking Windows APIs with Python"
author = ["svejk"]
draft = false
+++

## Windows API Hooking {#windows-api-hooking}


### The Hook {#the-hook}

API hooking refers to techniques for changing or extending the behavior of an OS or app by intercepting API function calls, messages, or events passed between software components. The code that performs the interception is called a **hook**. In Windows this can be done by injecting DLLs, injecting code, and using the Win32 Debug API toolset.


## References {#references}

[apriorit](https://www.apriorit.com/dev-blog/727-win-guide-to-hooking-windows-apis-with-python)
